In [3]:
from pyspark.sql import SparkSession
spark=SparkSession.builder.appName("spark sql").master("local[*]").getOrCreate()

WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by org.apache.spark.unsafe.Platform (file:/usr/local/spark-3.2.0-bin-hadoop3.2/jars/spark-unsafe_2.12-3.2.0.jar) to constructor java.nio.DirectByteBuffer(long,int)
WARNING: Please consider reporting this to the maintainers of org.apache.spark.unsafe.Platform
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
Using Spark's default log4j profile: org/apache/spark/log4j-defaults.properties
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
22/01/09 07:21:35 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
22/01/09 07:21:36 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.

In [4]:
spark

In [7]:

columns = ["language","users_count"]

data = [("Java", "20000"), ("Python", "100000"), ("Scala", "3000")]

df=spark.createDataFrame(data=data,schema=columns)
df.show()

+--------+-----------+
|language|users_count|
+--------+-----------+
|    Java|      20000|
|  Python|     100000|
|   Scala|       3000|
+--------+-----------+

In [8]:
ls ../data

cover_letter.txt        README.md            test.txt       zipcodes.csv
data.txt                simple-zipcodes.csv  zipcode1.json  zipcodes.json
multiline-zipcode.json  small_zipcode.csv    zipcode2.json

In [13]:
df=spark.read.csv("../data/zipcodes.csv",header=True,inferSchema=True)
df.show(3)

+------------+-------+-----------+-------------------+-----+--------------+-----+------+-----+-----+-----+-----------+-------+--------------------+--------------------+-------------+---------------+-------------------+----------+-----+
|RecordNumber|Zipcode|ZipCodeType|               City|State|  LocationType|  Lat|  Long|Xaxis|Yaxis|Zaxis|WorldRegion|Country|        LocationText|            Location|Decommisioned|TaxReturnsFiled|EstimatedPopulation|TotalWages|Notes|
+------------+-------+-----------+-------------------+-----+--------------+-----+------+-----+-----+-----+-----------+-------+--------------------+--------------------+-------------+---------------+-------------------+----------+-----+
|           1|    704|   STANDARD|        PARC PARQUE|   PR|NOT ACCEPTABLE|17.96|-66.22| 0.38|-0.87|  0.3|         NA|     US|     Parc Parque, PR|NA-US-PR-PARC PARQUE|        false|           null|               null|      null| null|
|           2|    704|   STANDARD|PASEO COSTA DEL SUR|   PR|NOT ACCEPTABLE|17.96|-66.22| 0.38|-0.87|  0.3|         NA|     US|Paseo Costa Del S...|NA-US-PR-PASEO CO...|        false|           null|               null|      null| null|
|          10|    709|   STANDARD|       BDA SAN LUIS|   PR|NOT ACCEPTABLE|18.14|-66.26| 0.38|-0.86| 0.31|         NA|     US|    Bda San Luis, PR|NA-US-PR-BDA SAN ...|        false|           null|               null|      null| null|
+------------+-------+-----------+-------------------+-----+--------------+-----+------+-----+-----+-----+-----------+-------+--------------------+--------------------+-------------+---------------+-------------------+----------+-----+
only showing top 3 rows

In [19]:
## select columns
df.select("Zipcode","State").show(3)

+-------+-----+
|Zipcode|State|
+-------+-----+
|    704|   PR|
|    704|   PR|
|    709|   PR|
+-------+-----+
only showing top 3 rows

In [28]:
## add and update columns
from pyspark.sql.functions import *
from pyspark.sql.types import *

"""
adding new column when condition
"""
df.withColumn("new_column",when(df.Zipcode >3000,"area_north").otherwise("area_khairthal")). \
    select("new_column","Zipcode").show(3)

+--------------+-------+
|    new_column|Zipcode|
+--------------+-------+
|area_khairthal|    704|
|area_khairthal|    704|
|area_khairthal|    709|
+--------------+-------+
only showing top 3 rows

In [29]:
"""
adding new column with lit fucntion
"""
df.withColumn("new_column",lit("khairthal")). \
    select("new_column","Zipcode").show(3)

+----------+-------+
|new_column|Zipcode|
+----------+-------+
| khairthal|    704|
| khairthal|    704|
| khairthal|    709|
+----------+-------+
only showing top 3 rows

In [36]:
"""
rename column
"""
df.withColumnRenamed("Zipcode","zipcodes").select("zipcodes").show(3)

+--------+
|zipcodes|
+--------+
|     704|
|     704|
|     709|
+--------+
only showing top 3 rows

In [56]:
"""
multiple rename column with structure type of data
"""


# columns = ["language","users_count"]

data = [("Java", "20000"), ("Python", "100000"),("Python", "100000"), ("Scala", "3000")]


columns=[
    StructField("language",StringType(),True),
    StructField("users_counts",StringType(),True)
]

schema=StructType(columns)


df=spark.createDataFrame(data=data,schema=schema)
df.show()

+--------+------------+
|language|users_counts|
+--------+------------+
|    Java|       20000|
|  Python|      100000|
|  Python|      100000|
|   Scala|        3000|
+--------+------------+

In [59]:
"""
drop a column
"""

df.drop("language").show()

+------------+
|users_counts|
+------------+
|       20000|
|      100000|
|      100000|
|        3000|
+------------+

In [58]:
"""
filter data
"""
df.filter(df.language=='Python').show()

+--------+------------+
|language|users_counts|
+--------+------------+
|  Python|      100000|
|  Python|      100000|
+--------+------------+

## distinct() and dropDuplicates() 
Duplicate rows could be remove or drop from Spark SQL DataFrame using distinct() and dropDuplicates() functions, distinct() can be used to remove rows that have the same values on all columns whereas dropDuplicates() can be used to remove rows that have the same values on multiple selected columns.

In [64]:
"""
distinct()
"""

print("before distinct=",df.count())
print("after distinct=",df.distinct().count())
df.distinct().show()

before distinct= 4
after distinct= 3
+--------+------------+
|language|users_counts|
+--------+------------+
|    Java|       20000|
|  Python|      100000|
|   Scala|        3000|
+--------+------------+

In [68]:
"""
dropDuplicates()
"""
df.dropDuplicates(["language","users_counts"]).show()

+--------+------------+
|language|users_counts|
+--------+------------+
|    Java|       20000|
|  Python|      100000|
|   Scala|        3000|
+--------+------------+

## How to Pivot and Unpivot a Spark DataFrame

Spark pivot() function is used to pivot/rotate the data from one DataFrame/Dataset column into multiple columns (transform row to column) and unpivot is used to transform it back (transform columns to rows).

In [74]:
data =[("Banana",1000,"USA"), ("Carrots",1500,"USA"), ("Beans",1600,"USA"),
      ("Orange",2000,"USA"),("Orange",2000,"USA"),("Banana",400,"China"),
      ("Carrots",1200,"China"),("Beans",1500,"China"),("Orange",4000,"China"),
      ("Banana",2000,"Canada"),("Carrots",2000,"Canada"),("Beans",2000,"Mexico")
          ]

sc=spark._sc
rdd=sc.parallelize(data)

df = rdd.toDF(["Product","Amount","Country"])
df.show()

+-------+------+-------+
|Product|Amount|Country|
+-------+------+-------+
| Banana|  1000|    USA|
|Carrots|  1500|    USA|
|  Beans|  1600|    USA|
| Orange|  2000|    USA|
| Orange|  2000|    USA|
| Banana|   400|  China|
|Carrots|  1200|  China|
|  Beans|  1500|  China|
| Orange|  4000|  China|
| Banana|  2000| Canada|
|Carrots|  2000| Canada|
|  Beans|  2000| Mexico|
+-------+------+-------+

In [82]:
"""
Spark SQL provides pivot() function to rotate the data from one column into multiple columns 
(transpose row to column). It is an aggregation where one of the grouping columns values transposed 
into individual columns with distinct data. From the above DataFrame, to get the total amount 
exported to each country of each product will do group by Product, pivot by Country, 
and the sum of Amount.
"""
pivotDF = df.groupBy("Product").pivot("Country").sum("Amount")
pivotDF.show()

+-------+------+-----+------+----+
|Product|Canada|China|Mexico| USA|
+-------+------+-----+------+----+
| Orange|  null| 4000|  null|4000|
|  Beans|  null| 1500|  2000|1600|
| Banana|  2000|  400|  null|1000|
|Carrots|  2000| 1200|  null|1500|
+-------+------+-----+------+----+

In [90]:
pivotDF.selectExpr("Product", "stack(4, 'Canada', Canada, 'China', China, 'Mexico', Mexico,'USA',USA) as (Amount, Country)").where("Country is not null").show()

+-------+------+-------+
|Product|Amount|Country|
+-------+------+-------+
| Orange| China|   4000|
| Orange|   USA|   4000|
|  Beans| China|   1500|
|  Beans|Mexico|   2000|
|  Beans|   USA|   1600|
| Banana|Canada|   2000|
| Banana| China|    400|
| Banana|   USA|   1000|
|Carrots|Canada|   2000|
|Carrots| China|   1200|
|Carrots|   USA|   1500|
+-------+------+-------+

In [104]:
"""
data types
"""
pivotDF.dtypes

[('Product', 'string'),
 ('Canada', 'bigint'),
 ('China', 'bigint'),
 ('Mexico', 'bigint'),
 ('USA', 'bigint')]

## joins

Spark DataFrame supports all basic SQL Join Types like INNER, LEFT OUTER, RIGHT OUTER, LEFT ANTI, LEFT SEMI, CROSS, SELF JOIN. Spark SQL Joins are wider transformations that result in data shuffling over the network hence they have huge performance issues when not designed with care.

In [112]:

  emp = [(1,"Smith",-1,"2018","10","M",3000),
    (2,"Rose",1,"2010","20","M",4000),
    (3,"Williams",1,"2010","10","M",1000),
    (4,"Jones",2,"2005","10","F",2000),
    (5,"Brown",2,"2010","40","",-1),
      (6,"Brown",2,"2010","50","",-1)
  ]
  empColumns = ["emp_id","name","superior_emp_id","year_joined",
       "emp_dept_id","gender","salary"]

  empDF = spark.createDataFrame(data=emp,schema=empColumns)
  empDF.show()

  dept = [("Finance",10),
    ("Marketing",20),
    ("Sales",30),
    ("IT",40)
  ]

  deptColumns = ["dept_name","dept_id"]
  deptDF = spark.createDataFrame(data=dept,schema=deptColumns)
  deptDF.show()

+------+--------+---------------+-----------+-----------+------+------+
|emp_id|    name|superior_emp_id|year_joined|emp_dept_id|gender|salary|
+------+--------+---------------+-----------+-----------+------+------+
|     1|   Smith|             -1|       2018|         10|     M|  3000|
|     2|    Rose|              1|       2010|         20|     M|  4000|
|     3|Williams|              1|       2010|         10|     M|  1000|
|     4|   Jones|              2|       2005|         10|     F|  2000|
|     5|   Brown|              2|       2010|         40|      |    -1|
|     6|   Brown|              2|       2010|         50|      |    -1|
+------+--------+---------------+-----------+-----------+------+------+

+---------+-------+
|dept_name|dept_id|
+---------+-------+
|  Finance|     10|
|Marketing|     20|
|    Sales|     30|
|       IT|     40|
+---------+-------+

In [115]:
"""
inner join
"""
empDF.join(deptDF,empDF.emp_dept_id==deptDF.dept_id,"inner").show()

+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|emp_id|    name|superior_emp_id|year_joined|emp_dept_id|gender|salary|dept_name|dept_id|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|     1|   Smith|             -1|       2018|         10|     M|  3000|  Finance|     10|
|     3|Williams|              1|       2010|         10|     M|  1000|  Finance|     10|
|     4|   Jones|              2|       2005|         10|     F|  2000|  Finance|     10|
|     2|    Rose|              1|       2010|         20|     M|  4000|Marketing|     20|
|     5|   Brown|              2|       2010|         40|      |    -1|       IT|     40|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+

In [123]:
"""
outer join
"""
empDF.join(deptDF,empDF.emp_dept_id==deptDF.dept_id,"outer").show()

+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|emp_id|    name|superior_emp_id|year_joined|emp_dept_id|gender|salary|dept_name|dept_id|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|     1|   Smith|             -1|       2018|         10|     M|  3000|  Finance|     10|
|     3|Williams|              1|       2010|         10|     M|  1000|  Finance|     10|
|     4|   Jones|              2|       2005|         10|     F|  2000|  Finance|     10|
|     2|    Rose|              1|       2010|         20|     M|  4000|Marketing|     20|
|  null|    null|           null|       null|       null|  null|  null|    Sales|     30|
|     5|   Brown|              2|       2010|         40|      |    -1|       IT|     40|
|     6|   Brown|              2|       2010|         50|      |    -1|     null|   null|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+

In [125]:
empDF.join(deptDF,empDF.emp_dept_id ==  deptDF.dept_id,"outer").show()
empDF.join(deptDF,empDF.emp_dept_id ==  deptDF.dept_id,"full").show()
empDF.join(deptDF,empDF.emp_dept_id ==  deptDF.dept_id,"fullouter").show()

+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|emp_id|    name|superior_emp_id|year_joined|emp_dept_id|gender|salary|dept_name|dept_id|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|     1|   Smith|             -1|       2018|         10|     M|  3000|  Finance|     10|
|     3|Williams|              1|       2010|         10|     M|  1000|  Finance|     10|
|     4|   Jones|              2|       2005|         10|     F|  2000|  Finance|     10|
|     2|    Rose|              1|       2010|         20|     M|  4000|Marketing|     20|
|  null|    null|           null|       null|       null|  null|  null|    Sales|     30|
|     5|   Brown|              2|       2010|         40|      |    -1|       IT|     40|
|     6|   Brown|              2|       2010|         50|      |    -1|     null|   null|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+

+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|emp_id|    name|superior_emp_id|year_joined|emp_dept_id|gender|salary|dept_name|dept_id|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|     1|   Smith|             -1|       2018|         10|     M|  3000|  Finance|     10|
|     3|Williams|              1|       2010|         10|     M|  1000|  Finance|     10|
|     4|   Jones|              2|       2005|         10|     F|  2000|  Finance|     10|
|     2|    Rose|              1|       2010|         20|     M|  4000|Marketing|     20|
|  null|    null|           null|       null|       null|  null|  null|    Sales|     30|
|     5|   Brown|              2|       2010|         40|      |    -1|       IT|     40|
|     6|   Brown|              2|       2010|         50|      |    -1|     null|   null|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+

+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|emp_id|    name|superior_emp_id|year_joined|emp_dept_id|gender|salary|dept_name|dept_id|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|     1|   Smith|             -1|       2018|         10|     M|  3000|  Finance|     10|
|     3|Williams|              1|       2010|         10|     M|  1000|  Finance|     10|
|     4|   Jones|              2|       2005|         10|     F|  2000|  Finance|     10|
|     2|    Rose|              1|       2010|         20|     M|  4000|Marketing|     20|
|  null|    null|           null|       null|       null|  null|  null|    Sales|     30|
|     5|   Brown|              2|       2010|         40|      |    -1|       IT|     40|
|     6|   Brown|              2|       2010|         50|      |    -1|     null|   null|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+

## using sql expression

In [130]:
empDF.createOrReplaceTempView("EMP")
deptDF.createOrReplaceTempView("DEPT")

In [141]:
spark.sql("select e.emp_id,e.name,e.year_joined,d.dept_name from EMP e \
          inner join DEPT as d where e.emp_dept_id=d.dept_id"
         ).show(2)

+------+--------+-----------+---------+
|emp_id|    name|year_joined|dept_name|
+------+--------+-----------+---------+
|     1|   Smith|       2018|  Finance|
|     3|Williams|       2010|  Finance|
+------+--------+-----------+---------+
only showing top 2 rows

In [135]:
spark.sql("select * from DEPT").show(1)

+---------+-------+
|dept_name|dept_id|
+---------+-------+
|  Finance|     10|
+---------+-------+
only showing top 1 row

## union() and unionAll()
Dataframe union() – union() method of the DataFrame is used to combine two DataFrame’s of the same structure/schema. If schemas are not the same it returns an error.

DataFrame unionAll() – unionAll() is deprecated since Spark “2.0.0” version and replaced with union().

DataFrameunionAll() – unionAll()(same no difference) method combines two DataFrames and returns the new DataFrame with all rows from two Dataframes regardless of duplicate data

In [143]:

  simpleData = [("James","Sales","NY",90000,34,10000),
    ("Michael","Sales","NY",86000,56,20000),
    ("Robert","Sales","CA",81000,30,23000),
    ("Maria","Finance","CA",90000,24,23000)
               ]
  df = spark.createDataFrame(simpleData,["employee_name","department","state","salary","age","bonus"])
  df.printSchema()
  df.show()

root
 |-- employee_name: string (nullable = true)
 |-- department: string (nullable = true)
 |-- state: string (nullable = true)
 |-- salary: long (nullable = true)
 |-- age: long (nullable = true)
 |-- bonus: long (nullable = true)

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|        James|     Sales|   NY| 90000| 34|10000|
|      Michael|     Sales|   NY| 86000| 56|20000|
|       Robert|     Sales|   CA| 81000| 30|23000|
|        Maria|   Finance|   CA| 90000| 24|23000|
+-------------+----------+-----+------+---+-----+

In [147]:

simpleData2 = [
    ("James","Sales","NY",90000,34,10000),
("Maria","Finance","CA",90000,24,23000),
("Jen","Finance","NY",79000,53,15000),
("Jeff","Marketing","CA",80000,25,18000),
("Kumar","Marketing","NY",91000,50,21000)
            ]
df2 = spark.createDataFrame(simpleData2,("employee_name","department","state","salary","age","bonus"))

df2.show()

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|        James|     Sales|   NY| 90000| 34|10000|
|        Maria|   Finance|   CA| 90000| 24|23000|
|          Jen|   Finance|   NY| 79000| 53|15000|
|         Jeff| Marketing|   CA| 80000| 25|18000|
|        Kumar| Marketing|   NY| 91000| 50|21000|
+-------------+----------+-----+------+---+-----+

In [150]:
df.union(df2).show()

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|        James|     Sales|   NY| 90000| 34|10000|
|      Michael|     Sales|   NY| 86000| 56|20000|
|       Robert|     Sales|   CA| 81000| 30|23000|
|        Maria|   Finance|   CA| 90000| 24|23000|
|        James|     Sales|   NY| 90000| 34|10000|
|        Maria|   Finance|   CA| 90000| 24|23000|
|          Jen|   Finance|   NY| 79000| 53|15000|
|         Jeff| Marketing|   CA| 80000| 25|18000|
|        Kumar| Marketing|   NY| 91000| 50|21000|
+-------------+----------+-----+------+---+-----+

In [151]:
df.unionAll(df2).show()

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|        James|     Sales|   NY| 90000| 34|10000|
|      Michael|     Sales|   NY| 86000| 56|20000|
|       Robert|     Sales|   CA| 81000| 30|23000|
|        Maria|   Finance|   CA| 90000| 24|23000|
|        James|     Sales|   NY| 90000| 34|10000|
|        Maria|   Finance|   CA| 90000| 24|23000|
|          Jen|   Finance|   NY| 79000| 53|15000|
|         Jeff| Marketing|   CA| 80000| 25|18000|
|        Kumar| Marketing|   NY| 91000| 50|21000|
+-------------+----------+-----+------+---+-----+

In [152]:
df.createOrReplaceTempView("table1")
df2.createOrReplaceTempView("table2")

## Dataframe union() – unionAll() sql 
union take only unique from both not duplicate
 but unionAll take all value with duplicate

In [160]:

spark.sql("select t1.employee_name from table1 as t1 union select t2.employee_name from table2 as t2").show()

spark.sql("select t1.employee_name from table1 as t1 union all select t2.employee_name from table2 as t2").show()

+-------------+
|employee_name|
+-------------+
|        James|
|      Michael|
|       Robert|
|        Maria|
|          Jen|
|         Jeff|
|        Kumar|
+-------------+

+-------------+
|employee_name|
+-------------+
|        James|
|      Michael|
|       Robert|
|        Maria|
|        James|
|        Maria|
|          Jen|
|         Jeff|
|        Kumar|
+-------------+

## PySpark mapPartitions() Examples (can only work on rdd)
https://sparkbyexamples.com/pyspark/pyspark-mappartitions/ <br>

https://www.educba.com/pyspark-mappartitions/ <br>

Key Points of PySpark MapPartitions(): <br>

It is similar to map() operation where the output of mapPartitions() returns the same number of rows as in input RDD. <br>
It is used to improve the performance of the map() when there is a need to do heavy initializations like Database connection. <br>
mapPartitions() applies a heavy initialization to each partition of RDD instead of each element of RDD.
It is a Narrow transformation operation <br>
PySpark DataFrame doesn’t have this operation hence you need to convert DataFrame to RDD to use mapPartitions()

In [162]:
"""
mapPartitions() is used to provide heavy initialization for each partition instead of applying 
to all elements this is the main difference between PySpark map() vs mapPartitions().
similar to map(), this also returns the same number of elements but the number of 
columns could be different.
"""


data = [('James','Smith','M',3000),
  ('Anna','Rose','F',4100),
  ('Robert','Williams','M',6200), 
]

columns = ["firstname","lastname","gender","salary"]
df = spark.createDataFrame(data=data, schema = columns)
df.show()

+---------+--------+------+------+
|firstname|lastname|gender|salary|
+---------+--------+------+------+
|    James|   Smith|     M|  3000|
|     Anna|    Rose|     F|  4100|
|   Robert|Williams|     M|  6200|
+---------+--------+------+------+

In [163]:
# This function calls for each partition
def reformat(partitionData):
    for row in partitionData:
        yield [row.firstname+","+row.lastname,row.salary*10/100]

df2=df.rdd.mapPartitions(reformat).toDF(["name","bonus"])
df2.show()

+---------------+-----+
|           name|bonus|
+---------------+-----+
|    James,Smith|300.0|
|      Anna,Rose|410.0|
|Robert,Williams|620.0|
+---------------+-----+

## PySpark UDF (User Defined Function)

In [170]:
"""
UDF’s are used to extend the functions of the framework and re-use these functions 
on multiple DataFrame’s. For example, you wanted to convert every first letter of
a word in a name string to a capital case; PySpark build-in features don’t have this 
function hence you can create it a UDF and reuse this as needed on many Data Frames. 
UDF’s are once created they can be re-used on several DataFrame’s and SQL expressions.
"""

columns = ["Seqno","Name"]
data = [("1", "john jones"),
    ("2", "tracey smith"),
    ("3", "amy sanders")]

df = spark.createDataFrame(data=data,schema=columns)

df.show(truncate=False)

+-----+------------+
|Seqno|Name        |
+-----+------------+
|1    |john jones  |
|2    |tracey smith|
|3    |amy sanders |
+-----+------------+

In [171]:
"""
The first step in creating a UDF is creating a Python function. Below snippet creates a function 
convertCase() which takes a string parameter and converts the first letter of every word to capital letter.
UDF’s take parameters of your choice and returns a value.
"""
def convertCase(str):
    resStr=""
    arr = str.split(" ")
    for x in arr:
       resStr= resStr + x[0:1].upper() + x[1:len(x)] + " "
    return resStr

In [176]:
"""
Now convert this function convertCase() to UDF by passing the function to PySpark SQL udf(), 
this function is available at org.apache.spark.sql.functions.udf package. 
Make sure you import this package before using it.

PySpark SQL udf() function returns org.apache.spark.sql.expressions.UserDefinedFunction class object.
"""

""" Converting function to UDF """

convertUDF = udf(lambda z: convertCase(z))

In [178]:
"""
Now you can use convertUDF() on a DataFrame column as a regular build-in function.
"""

df.select(col("Seqno"), \
    convertUDF(col("Name")).alias("Name") ) \
   .show(truncate=False)

+-----+-------------+
|Seqno|Name         |
+-----+-------------+
|1    |John Jones   |
|2    |Tracey Smith |
|3    |Amy Sanders  |
+-----+-------------+

In [192]:
## exm-2
"""
how to perform udf in one step using decorattor

@udf(returnType=StringType()) 
def upperCase(str):
    return str.upper()
"""
@udf(returnType=StringType()) 
def upperCase(str):
    return str.upper()

# df.select(col("Seqno"),upperCaseUDF(col("Name"))).show()
df.withColumn("capital Name", upperCaseUDF(col("Name"))) \
  .show(truncate=False)

+-----+------------+------------+
|Seqno|Name        |capital Name|
+-----+------------+------------+
|1    |john jones  |JOHN JONES  |
|2    |tracey smith|TRACEY SMITH|
|3    |amy sanders |AMY SANDERS |
+-----+------------+------------+

In [195]:
"""register udf in sql """
spark.udf.register("convertUDF", convertCase,StringType())

df.createOrReplaceTempView("NAME_TABLE")
spark.sql("select Seqno, convertUDF(Name) as Name from NAME_TABLE") \
     .show(truncate=False)

+-----+-------------+
|Seqno|Name         |
+-----+-------------+
|1    |John Jones   |
|2    |Tracey Smith |
|3    |Amy Sanders  |
+-----+-------------+

22/01/09 11:53:27 WARN SimpleFunctionRegistry: The function convertudf replaced a previously registered function.

In [198]:
""" null check """

columns = ["Seqno","Name"]
data = [("1", "john jones"),
    ("2", "tracey smith"),
    ("3", "amy sanders"),
    ('4',None)]

df2 = spark.createDataFrame(data=data,schema=columns)
df2.show(truncate=False)
df2.createOrReplaceTempView("NAME_TABLE2")
    

spark.udf.register("_nullsafeUDF", lambda str: convertCase(str) if not str is None else "None" , StringType())

spark.sql("select _nullsafeUDF(Name) from NAME_TABLE2") \
     .show(truncate=False)

spark.sql("select Seqno, _nullsafeUDF(Name) as Name from NAME_TABLE2 " + \
          " where Name is not null and _nullsafeUDF(Name) like '%John%'") \
     .show(truncate=False)

+-----+------------+
|Seqno|Name        |
+-----+------------+
|1    |john jones  |
|2    |tracey smith|
|3    |amy sanders |
|4    |null        |
+-----+------------+

22/01/09 11:57:27 WARN SimpleFunctionRegistry: The function _nullsafeudf replaced a previously registered function.

+------------------+
|_nullsafeUDF(Name)|
+------------------+
|John Jones        |
|Tracey Smith      |
|Amy Sanders       |
|None              |
+------------------+

+-----+-----------+
|Seqno|Name       |
+-----+-----------+
|1    |John Jones |
+-----+-----------+

## foreach fun()

In [205]:
df.foreach(lambda x:print(x['Seqno'],x['Name']))

3 amy sanders
1 john jones
2 tracey smith

## PySpark Groupby Explained with Example

In [208]:
"""
When we perform groupBy() on PySpark Dataframe, it returns GroupedData object which contains
below aggregate functions.

count() - Returns the count of rows for each group.

mean() - Returns the mean of values for each group.

max() - Returns the maximum of values for each group.

min() - Returns the minimum of values for each group.

sum() - Returns the total for values for each group.

avg() - Returns the average for values for each group.

agg() - Using agg() function, we can calculate more than one aggregate at a time.

pivot() - This function is used to Pivot the DataFrame which I will not be covered in this article as I already have a dedicated article for Pivot &
"""

simpleData = [("James","Sales","NY",90000,34,10000),
    ("Michael","Sales","NY",86000,56,20000),
    ("Robert","Sales","CA",81000,30,23000),
    ("Maria","Finance","CA",90000,24,23000),
    ("Raman","Finance","CA",99000,40,24000),
    ("Scott","Finance","NY",83000,36,19000),
    ("Jen","Finance","NY",79000,53,15000),
    ("Jeff","Marketing","CA",80000,25,18000),
    ("Kumar","Marketing","NY",91000,50,21000)
  ]

schema = ["employee_name","department","state","salary","age","bonus"]
df = spark.createDataFrame(data=simpleData, schema = schema)
df.printSchema()
df.show(truncate=False)

root
 |-- employee_name: string (nullable = true)
 |-- department: string (nullable = true)
 |-- state: string (nullable = true)
 |-- salary: long (nullable = true)
 |-- age: long (nullable = true)
 |-- bonus: long (nullable = true)

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|James        |Sales     |NY   |90000 |34 |10000|
|Michael      |Sales     |NY   |86000 |56 |20000|
|Robert       |Sales     |CA   |81000 |30 |23000|
|Maria        |Finance   |CA   |90000 |24 |23000|
|Raman        |Finance   |CA   |99000 |40 |24000|
|Scott        |Finance   |NY   |83000 |36 |19000|
|Jen          |Finance   |NY   |79000 |53 |15000|
|Jeff         |Marketing |CA   |80000 |25 |18000|
|Kumar        |Marketing |NY   |91000 |50 |21000|
+-------------+----------+-----+------+---+-----+

In [211]:
"""
1.
Let’s do the groupBy() on department column of DataFrame and then find the sum of salary 
for each department using sum() aggregate function.
"""
df.groupBy(df.department).sum("salary").show()

+----------+-----------+
|department|sum(salary)|
+----------+-----------+
|     Sales|     257000|
|   Finance|     351000|
| Marketing|     171000|
+----------+-----------+

In [212]:
"""
Calculate the minimum salary of each department using min()
"""

df.groupBy(df.department).min("salary").show()

+----------+-----------+
|department|min(salary)|
+----------+-----------+
|     Sales|      81000|
|   Finance|      79000|
| Marketing|      80000|
+----------+-----------+

In [214]:
df.groupBy("department").max("salary").show()

+----------+-----------+
|department|max(salary)|
+----------+-----------+
|     Sales|      90000|
|   Finance|      99000|
| Marketing|      91000|
+----------+-----------+

In [215]:
df.groupBy("department").avg("salary").show()

+----------+-----------------+
|department|      avg(salary)|
+----------+-----------------+
|     Sales|85666.66666666667|
|   Finance|          87750.0|
| Marketing|          85500.0|
+----------+-----------------+

In [217]:
df.groupBy("department").mean( "salary") .show()

+----------+-----------------+
|department|      avg(salary)|
+----------+-----------------+
|     Sales|85666.66666666667|
|   Finance|          87750.0|
| Marketing|          85500.0|
+----------+-----------------+

In [220]:
"""
PySpark groupBy and aggregate on multiple columns
"""
# //GroupBy on multiple columns
df.groupBy("department","state") \
    .sum("salary","bonus") \
    .show()

+----------+-----+-----------+----------+
|department|state|sum(salary)|sum(bonus)|
+----------+-----+-----------+----------+
|     Sales|   NY|     176000|     30000|
|     Sales|   CA|      81000|     23000|
|   Finance|   CA|     189000|     47000|
|   Finance|   NY|     162000|     34000|
| Marketing|   NY|      91000|     21000|
| Marketing|   CA|      80000|     18000|
+----------+-----+-----------+----------+

In [222]:
"""
Running more aggregates at a time using agg

Using agg() aggregate function we can calculate many aggregations at a time on a single statement
using PySpark SQL aggregate functions sum(), avg(), min(), max() mean() e.t.c. In order to use 
these, we should import "from pyspark.sql.functions import sum,avg,max,min,mean,count"

"""

df.groupBy("department") \
    .agg(sum("salary").alias("sum_salary"), \
         avg("salary").alias("avg_salary"), \
         sum("bonus").alias("sum_bonus"), \
         max("bonus").alias("max_bonus") \
     ) \
    .show(truncate=False)

+----------+----------+-----------------+---------+---------+
|department|sum_salary|avg_salary       |sum_bonus|max_bonus|
+----------+----------+-----------------+---------+---------+
|Sales     |257000    |85666.66666666667|53000    |23000    |
|Finance   |351000    |87750.0          |81000    |24000    |
|Marketing |171000    |85500.0          |39000    |21000    |
+----------+----------+-----------------+---------+---------+

In [224]:
"""Using filter on aggregate data"""
df.groupBy("department") \
    .agg(sum("salary").alias("sum_salary"), \
      avg("salary").alias("avg_salary"), \
      sum("bonus").alias("sum_bonus"), \
      max("bonus").alias("max_bonus")) \
    .where(col("sum_bonus") >= 50000) \
    .show(truncate=False)

+----------+----------+-----------------+---------+---------+
|department|sum_salary|avg_salary       |sum_bonus|max_bonus|
+----------+----------+-----------------+---------+---------+
|Sales     |257000    |85666.66666666667|53000    |23000    |
|Finance   |351000    |87750.0          |81000    |24000    |
+----------+----------+-----------------+---------+---------+

## concat_ws() methos

In [225]:
columns = ["name","languagesAtSchool","currentState"]
data = [("James,,Smith",["Java","Scala","C++"],"CA"), \
    ("Michael,Rose,",["Spark","Java","C++"],"NJ"), \
    ("Robert,,Williams",["CSharp","VB"],"NV")]

df = spark.createDataFrame(data=data,schema=columns)
df.printSchema()
df.show(truncate=False)

root
 |-- name: string (nullable = true)
 |-- languagesAtSchool: array (nullable = true)
 |    |-- element: string (containsNull = true)
 |-- currentState: string (nullable = true)

+----------------+------------------+------------+
|name            |languagesAtSchool |currentState|
+----------------+------------------+------------+
|James,,Smith    |[Java, Scala, C++]|CA          |
|Michael,Rose,   |[Spark, Java, C++]|NJ          |
|Robert,,Williams|[CSharp, VB]      |NV          |
+----------------+------------------+------------+

In [228]:
df2 = df.withColumn("languagesAtSchool",
   concat_ws(",",col("languagesAtSchool")))
df2.show()

+----------------+-----------------+------------+
|            name|languagesAtSchool|currentState|
+----------------+-----------------+------------+
|    James,,Smith|   Java,Scala,C++|          CA|
|   Michael,Rose,|   Spark,Java,C++|          NJ|
|Robert,,Williams|        CSharp,VB|          NV|
+----------------+-----------------+------------+

In [231]:
df.createOrReplaceTempView("ARRAY_STRING")

spark.sql("select name,concat_ws(',',languagesAtSchool) as languagesAtSchool from ARRAY_STRING").show()

+----------------+-----------------+
|            name|languagesAtSchool|
+----------------+-----------------+
|    James,,Smith|     James,,Smith|
|   Michael,Rose,|    Michael,Rose,|
|Robert,,Williams| Robert,,Williams|
+----------------+-----------------+

## substring()

In [237]:
df.withColumn("first_name",substring(df.name,1,4)).show()

+----------------+------------------+------------+----------+
|            name| languagesAtSchool|currentState|first_name|
+----------------+------------------+------------+----------+
|    James,,Smith|[Java, Scala, C++]|          CA|      Jame|
|   Michael,Rose,|[Spark, Java, C++]|          NJ|      Mich|
|Robert,,Williams|      [CSharp, VB]|          NV|      Robe|
+----------------+------------------+------------+----------+

In [235]:
spark.sql("select name,substring(name,1,4) as spilt_name from ARRAY_STRING").show()

+----------------+----------+
|            name|spilt_name|
+----------------+----------+
|    James,,Smith|      Jame|
|   Michael,Rose,|      Mich|
|Robert,,Williams|      Robe|
+----------------+----------+

## split() method

In [240]:
#getting firstname
df.withColumn("first_name",split(df.name,",")[0]).show()

+----------------+------------------+------------+----------+
|            name| languagesAtSchool|currentState|first_name|
+----------------+------------------+------------+----------+
|    James,,Smith|[Java, Scala, C++]|          CA|     James|
|   Michael,Rose,|[Spark, Java, C++]|          NJ|   Michael|
|Robert,,Williams|      [CSharp, VB]|          NV|    Robert|
+----------------+------------------+------------+----------+

## regexp_replace(),overlay()

In [263]:
address = [(1,"14851 Jeffrey Rd","DE"),
    (2,"43421 Margarita St","NY"),
    (3,"13111 Siemon Ave","CA")]
df =spark.createDataFrame(address,["id","address","state"])
df.show()

+---+------------------+-----+
| id|           address|state|
+---+------------------+-----+
|  1|  14851 Jeffrey Rd|   DE|
|  2|43421 Margarita St|   NY|
|  3|  13111 Siemon Ave|   CA|
+---+------------------+-----+

In [264]:
"""
By using PySpark SQL function regexp_replace() you can replace a column value with a string 
for another string/substring. regexp_replace() uses Java regex for matching, if the regex does
not match it returns an empty string, the below example replace the street name Rd value 
with Road string on address column.
"""
df.withColumn('address', regexp_replace('address', 'Rd', 'Road')) \
  .show(truncate=False)

+---+------------------+-----+
|id |address           |state|
+---+------------------+-----+
|1  |14851 Jeffrey Road|DE   |
|2  |43421 Margarita St|NY   |
|3  |13111 Siemon Ave  |CA   |
+---+------------------+-----+

In [265]:
""" replace with when condition """
df.withColumn('address',
              when(df.address.endswith('Rd'),regexp_replace(df.address, 'Rd', 'Road')). \
              when(df.address.endswith('St'),regexp_replace(df.address, 'St', 'State')). \
              when(df.address.endswith('Ave'),regexp_replace(df.address, 'Ave', 'Avenue')). \
              otherwise(df.address)
                 ).show(truncate=False)

+---+---------------------+-----+
|id |address              |state|
+---+---------------------+-----+
|1  |14851 Jeffrey Road   |DE   |
|2  |43421 Margarita State|NY   |
|3  |13111 Siemon Avenue  |CA   |
+---+---------------------+-----+

## PySpark to_timestamp() – Convert String to Timestamp type

In [286]:
df=spark.createDataFrame(
        data = [ ("1","2019-06-24 12:01:19.000")],
        schema=["id","input_timestamp"])

df.printSchema()
df.show()

root
 |-- id: string (nullable = true)
 |-- input_timestamp: string (nullable = true)

+---+--------------------+
| id|     input_timestamp|
+---+--------------------+
|  1|2019-06-24 12:01:...|
+---+--------------------+

In [305]:
df2=df.withColumn("datetime",to_timestamp(df.input_timestamp))

In [307]:
df2.printSchema()

root
 |-- id: string (nullable = true)
 |-- input_timestamp: string (nullable = true)
 |-- datetime: timestamp (nullable = true)